package org.exadel.bsu.tasks.second.collections;

/**
 * @author skrauchenia
 */
public class MaxVariationTask {

    /**
     * Дано целое число - <code>number</code>. Представьте его в двоичной системе.
     * Игнорируйте незначащие нули (пример: 19 = 10011). Сдвигайте побитово вправо
     * на один бит по циклу (последняя цифра становится первой, а все остальные
     * сдвигаются на одну позицию вправо) - 10011, 11001, 11100, 01110, 00111, 10011
     * до тех пор, пока не получите изначальное число. Выберите максимальное число
     * @param number положительное исходное число
     * @return максимальная вариация исходного числа
     */
    public Integer execute(Integer number) {
        // TODO: put your code here
        return 0;
    }
}
